#! /usr/bin/env python3

"""Определения структур для взаимодействия с приборами Fastwel AIM730."""

from ctypes import Structure, c_uint8, c_uint16
from enum import IntEnum


class AIM730_OUTPUT_RANGE(IntEnum):
    """Определение параметра "Выходной диапазон канала" в конфигурации модуля AIM730."""

    MA0_20 = 0          # 0...20 мА
    MA4_20 = 1          # 4...20 мА


class AIM730_SLEW_RATE(IntEnum):
    """Определение параметра "Скорость нарастания канала" в конфигурации модуля AIM730."""

    DAC_I_SR_DISABLED = 0           # Без ограничения (Максимум)
    DAC_I_SR_0_305__0_244 = 1       # 0.3 мА/с    /   0.2 мА/с
    DAC_I_SR_0_915__0_732 = 2       # 0.9 мА/с    /   0.7 мА/с
    DAC_I_SR_2_135__1_708 = 3       # 2.1 мА/с    /   1.7 мА/с
    DAC_I_SR_4_575__3_66 = 4        # 4.5 мА/с    /   3.6 мА/с
    DAC_I_SR_9_455__7_564 = 5       # 9.5 мА/с    /   7.6 мА/с
    DAC_I_SR_19_2__15_4 = 6         # 19.2 мА/с   /   15.3 мА/с
    DAC_I_SR_38_7__30_9 = 7         # 38.7 мА/с   /   30.9 мА/с
    DAC_I_SR_77_8__62_2 = 8         # 77.8 мА/с   /   66.2 мА/с
    DAC_I_SR_155_8__124_7 = 9       # 155.8 мА/с  /   124.7 мА/с
    DAC_I_SR_312_0__249_6 = 10      # 312.0 мА/с  /   249.6 мА/с
    DAC_I_SR_624_3__499_5 = 11      # 624.3 мА/с  /   499.5 мА/с
    DAC_I_SR_1248_9__999_2 = 12     # 1.2 А/с     /   1.0 А/с
    DAC_I_SR_2498_5__1998_8 = 13    # 2.5 А/с     /   2.0 А/с
    DAC_I_SR_4996_8__3997_4 = 14    # 5.0 А/с     /   4.0 А/с
    DAC_I_SR_9993_9__7995_1 = 15    # 10.0 А/с    /   8.0 А/с
    DAC_I_SR_19988_1__15990_5 = 16  # 20.0 А/с    /   16.0 А/с


class AIM730_CONFIGURATION(Structure):
    """Область конфигурационных параметров модуля AIM730."""

    _pack_ = 1
    _fields_ = [
        ("outputInitialValue0", c_uint16),      # Начальное значение канала 1
        ("outputInitialValue1", c_uint16),      # Начальное значение канала 2
        ("outputSafeValue0", c_uint16),         # Безопасное значение канала 1
        ("outputSafeValue1", c_uint16),         # Безопасное значение канала 2
        ("temperatureZonesSupport", c_uint8),   # Зарезервировано
        ("outputRange0", c_uint8),              # Выходной диапазон канала 1
        ("outputRange1", c_uint8),              # Выходной диапазон канала 2
        ("slewRateLimit0", c_uint8),            # Скорость нарастания канала 1
        ("slewRateLimit1", c_uint8),            # Скорость нарастания канала 2
    ]


class AIM730_INPUTS(Structure):
    """Область входных каналов "Inputs" модуля AIM730."""

    _pack_ = 1
    _fields_ = [
        ("diagnostics", c_uint8),       # Значение FFh свидетельствует об отсутствии связи с модулем по внутренней шине
        ("outputValue0", c_uint16),     # Текущее значение на первом канале
        ("outputValue1", c_uint16),     # Текущее значение на втором канале
    ]


class AIM730_OUTPUTS(Structure):
    """Область выходных каналов "Outputs" модуля AIM730."""

    _pack_ = 1
    _fields_ = [
        ("output0", c_uint16),      # Устанавливаемое значение на выходе первого канала
        ("output1", c_uint16),      # Устанавливаемое значение на выходе второго канала
    ]


class AIM730(Structure):
    """Структура, представляющая модуль AIM730."""

    _pack_ = 1
    _fields_ = [
        ("Inputs", AIM730_INPUTS),                  # Область входных параметров Inputs модуля
        ("Outputs", AIM730_INPUTS),                 # Область выходных параметров Outputs модуля
        ("Configuration", AIM730_CONFIGURATION),    # Область конфигурационных параметров модуля
    ]
